# Acquisition A

4) In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data.

Create a pandas dataframe, df_iris, from this data.

In [1]:
import pandas as pd

from pydataset import data

In [78]:
#load the iris data and create a dataframe
iris = data('iris') 
df_iris = pd.DataFrame(iris)

a) print the first 3 rows

In [3]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

b) print the number of rows and columns (shape)

In [4]:
df_iris.shape

(150, 5)

c) print the column names

In [5]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

d) print the data type of each column

In [6]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

e) print the summary statistics for each of the numeric variables

In [7]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

5) Read the data from this google sheet into a dataframe, df_google.

In [79]:
#read the google_train.xlsx file and create a dataframe; df_google
df_google = pd.read_excel('google_train.xlsx')

a) print the first 3 rows

In [9]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

b) print the number of rows and columns

In [10]:
df_google.shape

(891, 12)

c) print the column names

In [11]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

d) print the data type of each column

In [12]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

e) print the summary statistics for each of the numeric variables

In [13]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

f) print the unique values for each of your categorical variables

In [14]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

6) Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named df_excel.

In [80]:
#read the movie_data csv file and create a dataframe; df_excel
df_excel = pd.read_csv('movie_data.csv')

a) assign the first 100 rows to a new dataframe, df_excel_sample

In [74]:
#assign the first 100 rows of the dataframe, df_excel to df_excel_sample
df_excel_sample = df_excel.head(100)

b) print the number of rows of your original dataframe

In [75]:
#use 0 in a square bracket to get the first index from the .shape method
df_excel.shape[0]

508

c) print the first 5 column names

In [77]:
#use a colon and square brackets(5) to return the first five column names of the DataFrame df_excel
df_excel.columns[:5]

Index(['Movie Title', 'Release Date', 'Year', 'Month', 'Weekday'], dtype='object')

d) print the column names that have a data type of object

In [60]:
#Filter columns with the data type 'object'
df_excel.dtypes[df_excel.dtypes == 'object']

Movie Title               object
Release Date              object
Wikipedia URL             object
Genre (1)                 object
Genre (2)                 object
Director (1)              object
Director (2)              object
Cast (1)                  object
Cast (2)                  object
Cast (3)                  object
Cast (4)                  object
Cast (5)                  object
Budget ($)                object
Box Office Revenue ($)    object
Profit                    object
Is_blockbuster            object
Comedy_Blockbuster        object
Unnamed: 21               object
Unnamed: 22               object
Unnamed: 23               object
Unnamed: 24               object
Unnamed: 25               object
dtype: object

e) compute the range for each of the numeric variables.

In [81]:
#calculate the range for each numeric column in the DataFrame 'df_excel' using the .describe function
df_excel.describe().loc['max'] - df_excel.describe().loc['min']

Year                     4.0
Month                   11.0
Weekday                  6.0
Months_since_release    56.0
dtype: float64